---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.GetBasicIEnumerator
source: html/6a8e652f-883c-e09b-42eb-ef672356d951.htm
---
# Autodesk.Revit.DB.ExportFontTable.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.